#2-10 运算符
#python中的主要运算符：算术运算符 赋值运算符 关系运算符 逻辑运算符
#算术运算符：用于计算如：加减乘除
# a=5
# b=2
# print(a/b)#可以保留小数
# print(a//b)#只可以保留整数
# print(a%b)#获取余数
# print(a**b)#获取幂次方

#赋值运算符：给变量赋值如：等号
# a=125
# b=a+1
# b+=126
# a+=5#在a的基础上再加5   a+=a+5
# print(a)
# print(b)

#关系运算符：比较两个变量之间的关系
#>  <  ==  <= >=  !=(不等号)
#关系运算符运算的结果一定是布尔值
#等等== 不等！= 常用来判断字符串是否相等
# a=5
# b=126
# print(a!=b)
# c='hallo'
# d='hallo'
# print(c!=d)

#逻辑运算符：判断表达式之间的逻辑关系
#and(两边都是正确的才是true) or（两边只要有一边满足则就是true） not（对右边的布尔值的表达式取反）
# print(5>3 and 6<3)#and左右两边都是布尔值
# print(5>3 or 6<3)#or左右两边都是布尔值
# print(not 55<3)#not只有右边才有布尔值